<details><summary style="display:list-item; font-size:16px; color:blue;">Jupyter Help</summary>
    
Having trouble testing your work? Double-check that you have followed the steps below to write, run, save, and test your code!
    
[Click here for a walkthrough GIF of the steps below](https://static-assets.codecademy.com/Courses/ds-python/jupyter-help.gif)

Run all initial cells to import libraries and datasets. Then follow these steps for each question:
    
1. Add your solution to the cell with `## YOUR SOLUTION HERE ## `.
2. Run the cell by selecting the `Run` button or the `Shift`+`Enter` keys.
3. Save your work by selecting the `Save` button, the `command`+`s` keys (Mac), or `control`+`s` keys (Windows).
4. Select the `Test Work` button at the bottom left to test your work.

![Screenshot of the buttons at the top of a Jupyter Notebook. The Run and Save buttons are highlighted](https://static-assets.codecademy.com/Paths/ds-python/jupyter-buttons.png)

#### Setup

Start by running the cell below to import `pandas` and import the exercise datasets.

In [10]:
import pandas as pd
games = pd.read_csv('games.csv')
scores = pd.read_csv('scores.csv')
locations = pd.read_csv('locations.csv')
games.head(), scores.head()

(         date home_team         away_team  location_id  scores_id
 0  1872-11-30  Scotland           England            0          0
 1  1914-02-28  Scotland             Wales            0          0
 2  1946-11-27  Scotland  Northern Ireland            0          0
 3  1965-05-08  Scotland             Spain            0          0
 4  1970-04-22  Scotland             Wales            0          0,
    id  home_score  away_score
 0   0           0           0
 1   1           2           1
 2   2           3           0
 3   3           4           0
 4   4           7           2)

#### Narrative Example

The cell below generates the example from the exercise narrative. Run the code to see how pandas performs the merge. Feel free to experiment with the different options!

In [2]:
X = pd.DataFrame({'Category':['A','B'], 'Value':[1,2]})
Y = pd.DataFrame({'Category':['B','C'], 'Value':[3,4]})

pd.merge(left = X, right = Y, left_on = 'Category', right_on='Category', how='inner')

  Category  Value_x  Value_y
0        B        2        3

#### 1. Inner Merge `games` and `scores`

Perform an inner merge with the DataFrames `games` and `scores`. The left DataFrame should be `games`, and the columns being matched should be `scores_id` and `id`.

Save the result as `merged_df`.

Make sure to run the solution cell and save the notebook before selecting `Test Work`.

In [3]:
## YOUR SOLUTION HERE ##
merged_df = pd.merge(left = games,
         right = scores,
         left_on = 'scores_id',
         right_on = 'id',
         how = 'inner')

# show output
merged_df.head()

,date,home_team,away_team,location_id,scores_id,id,home_score,away_score
0,1872-11-30,Scotland,England,0,0,0,0,0
1,1914-02-28,Scotland,Wales,0,0,0,0,0
2,1946-11-27,Scotland,Northern Ireland,0,0,0,0,0
3,1965-05-08,Scotland,Spain,0,0,0,0,0
4,1970-04-22,Scotland,Wales,0,0,0,0,0

#### 2. Post-merge Analysis

Now that we've merged the two tables, we can run analyses using all our data! For example, run the code in the cell below to see which team has scored the most home goals in a single game.

Make sure to run the solution cell and save the notebook before selecting `Test Work`.

In [11]:
merged_df.sort_values(by='home_score', ascending=False).head()

,date,home_team,away_team,location_id,scores_id,id,home_score,away_score
44349,2001-04-11,Australia,American Samoa,1261,128,128,31,0
44320,1971-09-13,Tahiti,Cook Islands,333,112,112,30,0
44340,1979-08-30,Fiji,Kiribati,648,123,123,24,0
44348,2001-04-09,Australia,Tonga,1261,127,127,22,0
44330,1966-04-03,Libya,Oman,380,118,118,21,0

#### 3. Inner Merge `merged_df` and `locations`

We have another `ID` column in `games` called `location_id`. This column connects to a `locations` table that tells us where each game occurred. We've printed the `locations` table in the first cell below.

In the following cell, perform an inner merge on `merged_df` and `locations`. The left DataFrame should be `merged_df`. The columns being matched should be `location_id` and `id`.

Assign the result of the merge to `full_df`. Where did the largest home score (from the prior checkpoint) occur?

Make sure to run the solution cell and save the notebook before selecting `Test Work`.

In [12]:
locations.head()

   id       city   country
0   0    Glasgow  Scotland
1   1     London   England
2   2    Wrexham     Wales
3   3  Blackburn   England
4   4    Belfast   Ireland

In [13]:
## YOUR SOLUTION HERE ##
full_df = pd.merge(left = merged_df,
         right = locations,
         left_on = 'location_id',
         right_on = 'id',
         how = 'inner')

# show output
full_df.sort_values(by='home_score', ascending=False).head()

,date,home_team,away_team,location_id,scores_id,id_x,home_score,away_score,id_y,city,country
43794,2001-04-11,Australia,American Samoa,1261,128,128,31,0,1261,Coffs Harbour,Australia
18829,1971-09-13,Tahiti,Cook Islands,333,112,112,30,0,333,Papeete,French Polynesia
42031,1979-08-30,Fiji,Kiribati,648,123,123,24,0,648,Nausori,Fiji
43793,2001-04-09,Australia,Tonga,1261,127,127,22,0,1261,Coffs Harbour,Australia
21737,1966-04-03,Libya,Oman,380,118,118,21,0,380,Baghdad,Iraq